ХамелионЦРПТ/src/Catalogs/Продукция_ХамелеонЦРПТ/Продукция_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Продукция_ХамелеонЦРПТ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>GTIN</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВУчетнойСистеме</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МодельПроизводителяАртикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БрендТорговаяМарка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННПроизводителяИмпортёра</name>
    <type>
      <types>CatalogRef.ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроизводства</name>
    <type>
      <types>CatalogRef.СтранаПроизводства_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>CatalogRef.КодТНВЭД_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбуви</name>
    <type>
      <types>CatalogRef.ВидОбуви_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>МатериалВерха</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатериалПодкладки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатериалНиза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкаНДС_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сезон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <type>
      <types>CatalogRef.Изготовители_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Стелька</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>CatalogRef.ПолОбуви_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>CatalogRef.РазмерВШтихмассовойСистеме_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляСопоставления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводВОборот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипПродукции_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВГруппе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковкиСигарет</name>
    <type>
      <types>EnumRef.ТипУпаковкиСигареты_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСигарет</name>
    <type>
      <types>CatalogRef.ГруппаСигарет_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальнаяЦенаНаСигареты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Остатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>guid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВБлоке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GTINУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GTINКороба</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭДКороткий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭДДляОстатка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозрастнаяКатегория</name>
    <type>
      <types>EnumRef.ВозратнаяКатегория_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРеквизитШины</name>
    <type>
      <types>CatalogRef.ДополнительныеРеквизиты_Шины_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРеквизитМолоко</name>
    <type>
      <types>CatalogRef.ДополнительныеРеквизиты_Молоко_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРеквизитПарфюм</name>
    <type>
      <types>CatalogRef.ДополнительныеРеквизиты_Парфюмерия_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноЭмитировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноВводитьВОборот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Объясненение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>feed_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКарточки</name>
    <type>
      <types>EnumRef.СтатусыКарточекВНК_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРеквизитВелосипед</name>
    <type>
      <types>CatalogRef.ДополнительныеРеквизиты_Велосипеды_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеРеквизитВода</name>
    <type>
      <types>CatalogRef.ДополнительныеРеквизит_ПитьеваяВода_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеРеквизитОдежда</name>
    <type>
      <types>CatalogRef.ДополнительныеРеквизиты_ПредметыОдежды_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеРеквизитФото</name>
    <type>
      <types>CatalogRef.ДополинительныеРеквизиты_Фото_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРеквизитОбщиеНК</name>
    <type>
      <types>CatalogRef.ДополинтельныеРеквизиты_ДругиеНК_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРеквизитБелье</name>
    <type>
      <types>CatalogRef.ДополнительныеРеквизиты_Белье_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРеквизитРамы</name>
    <type>
      <types>CatalogRef.ДополнительныеРеквизиты_Рамы_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРеквизитКоляски</name>
    <type>
      <types>CatalogRef.ДополнительныеРеквизиты_Кресла_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения_УПД</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРеквизитАльтернативныйТабак</name>
    <type>
      <types>CatalogRef.ДополнительныеРеквизиты_АльтернативныйТабак_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВспомогательныйШтрихкод</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРеквизитОбувь</name>
    <type>
      <types>CatalogRef.ДополнительныеРеквизиты_ОБУВЬ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРеквизитТабак</name>
    <type>
      <types>CatalogRef.ДополнительныйРеквизитТабак_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>МВ_Интегратор</name>
    <comment>//Кириченко</comment>
    <type>
      <types>CatalogRef.МВ_Интеграторы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехническаяКарточка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>CatalogRef.ТипУпаковкиОбщий_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставДляНабора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Рисунки</name>
    <attributes>
      <name>ТипРисунка</name>
      <type>
        <types>CatalogRef.ВидыРисунков_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресРисункаURL</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>gtin</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставНабора</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВНаборе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ХамелионЦРПТ/src/AccumulationRegisters/ОстаткиКМ_в_Обороте_ХамелеонЦРПТ/ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиКМ_в_Обороте_ХамелеонЦРПТ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ID_Строки</name>
    <type>
      <types>CatalogRef.ID_строки_партия_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ХамелионЦРПТ/src/Enums/ВидДокументаУпаковок_ХамелеонЦРПТ/ВидДокументаУпаковок_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДокументаУпаковок_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Формирование</name>
  </enumValues>
  <enumValues>
    <name>Расформирование</name>
  </enumValues>
  <enumValues>
    <name>ИзъятиеИзУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ДобавлениеВУпаковку</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Enums/СтатусыКМДляАгрегации_ХамелеонЦРПТ/СтатусыКМДляАгрегации_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКМДляАгрегации_ХамелеонЦРПТ</name>
  <enumValues>
    <name>КМВОбороте</name>
  </enumValues>
  <enumValues>
    <name>КМЭмитирован</name>
  </enumValues>
  <enumValues>
    <name>КМДоЭммитирования</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Catalogs/Продукция_ХамелеонЦРПТ/Forms/ФормаВыбораКМ/Module.bsl
&НаКлиенте
Процедура ПродукцияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
//	СтандартнаяОбработка=Ложь;
	
	Если Элементы.Продукция.ТекущиеДанные<>Неопределено Тогда
		ЭтаФорма.Закрыть(Элементы.Продукция.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Организация="";
	Параметры.Свойство("Организация",Организация);
	Продукция.Параметры.УстановитьЗначениеПараметра("Организация",Организация);
	
	
КонецПроцедуры


&НаКлиенте
Процедура ВыборПартии(Команда)
	// Вставить содержимое обработчика.
	Масс=Новый Массив;
	
	Для Каждого Стр Из Элементы.Список.ВыделенныеСтроки  Цикл
		Масс.Добавить(Стр);
		//Элементы.Список.ТекущаяСтрока=Стр;
	Конеццикла;
	
	Масс_1=Новый Массив;
	Для Каждого Стр Из Масс  Цикл
		Элементы.Список.ТекущаяСтрока=Стр;
		Масс_1.Добавить(Элементы.Список.ТекущиеДанные.СерийныйНомер)
	Конеццикла;
	ЭтаФорма.Закрыть(Масс_1);
	
	//ЭтаФорма.Закрыть(ВернутьМассивУжеЦИСОВ());
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Масс=Новый Массив;
	
	Для Каждого Стр Из Элементы.Список.ВыделенныеСтроки  Цикл
		Масс.Добавить(Стр);
		//Элементы.Список.ТекущаяСтрока=Стр;
	Конеццикла;
	
	Масс_1=Новый Массив;
	Для Каждого Стр Из Масс  Цикл
		Элементы.Список.ТекущаяСтрока=Стр;
		Масс_1.Добавить(Элементы.Список.ТекущиеДанные.СерийныйНомер)
	Конеццикла;
	ЭтаФорма.Закрыть(Масс_1);
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ОбновитьОСтаток();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОстаток()
	МассивУдалимначалаВсе=Новый Массив;
	Для Каждого стр_1 Из Продукция.Отбор.Элементы Цикл
		Если Стр_1.Представление="ОТБОРОСТАТКИ" Тогда
			МассивУдалимначалаВсе.Добавить(Стр_1);
		КонецЕсли;
	Конеццикла;
	Для Каждого Стр Из МассивУдалимначалаВсе Цикл
		
		Продукция.Отбор.Элементы.Удалить(Стр);
	Конеццикла;
	Если Не ПоказатьВсе Тогда
		
		Стр=Продукция.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Стр.ВидСравнения=ВидСравненияКомпоновкиДанных.НеРавно;
		Стр.Использование=Истина;
		Стр.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("КоличествоОстаток");
		Стр.ПравоеЗначение=0; 
		Стр.Представление="ОТБОРОСТАТКИ";
		Стр.РежимОтображения=РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьОстаток();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьОрганзиацияю();
КонецПроцедуры


Процедура ОбновитьОрганзиацияю()
	Продукция.Параметры.УстановитьЗначениеПараметра("Организация",Организация);
КонецПроцедуры

&НаКлиенте
Процедура Выбор(Команда)
	
	// Вставить содержимое обработчика.
	
	Если Элементы.Продукция.ТекущиеДанные<>Неопределено Тогда
		ЭтаФорма.Закрыть(Элементы.Продукция.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасформироватьУпаковку(Команда)
	// Вставить содержимое обработчика.
	Если Элементы.Список.ТекущиеДанные<>Неопределено Тогда
		Штрих=Элементы.Список.ТекущиеДанные.СерийныйНомер;
		Если СтрДлина(Штрих)=18 
			И Элементы.Список.ТекущиеДанные.КоличествоОстаток>0 Тогда
			
	Обр=ПолучитьФорму("Обработка._Запуск_ХамелеонЦРПТ.Форма.Форма");
	Если Обр.Организации.Количество()=0 Тогда
		Обр.ПодключитьсяКЦРПТ(Команда,Ложь);
	КонецЕсли;
	Если Обр.Организации.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
			
			
	
			ДокумС=СОздатьДокументРасформирования(Штрих,Обр.Пользователь,
			Обр.Организации[0].Организация);
			
			ОткрытьФорму("Документ.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ.Форма.ФормаДокумента",
			Новый Структура("КЛюч",ДокумС));
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СОздатьДокументРасформирования(Знач ШШ,Знач Пользователь,Знач Организация)
	
	
		Докум=Документы.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ.СоздатьДокумент();
		Докум.Организация=Организация;
		Докум.ТекущийПользователь=Пользователь;
		Докум.ТипДокумента=Перечисления.ВидДокументаУпаковок_ХамелеонЦРПТ.Расформирование;
		Докум.СтатусКМ=Перечисления.СтатусыКМДляАгрегации_ХамелеонЦРПТ.КМВОбороте;
		
		Докум.Дата=ТекущаяДата();
		Добав=Докум.Марки.Добавить();
		Добав.Марка=ШШ;
	
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Продукция
						|ИЗ
						|	РегистрНакопления.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ КАК ОстаткиКМ_в_Обороте_ХамелеонЦРПТ
						|ГДЕ
						|	ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.СерийныйНомер = &СерийныйНомер";
					
					Запрос.УстановитьПараметр("СерийныйНомер", ШШ);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
						Добав.Продукция=ВыборкаДетальныеЗаписи.Продукция;
						Если ЗначениеЗАполнено(Добав.Продукция) Тогда
							Прервать;
						Конецесли;
					КонецЦикла;
	
	       Докум.Записать(РежимЗаписиДокумента.Запись);
		   Возврат докум.Ссылка
	//Докум.НомерКороба=ШШ;
	  
Конецфункции

&НаКлиенте
Процедура ПоказатьИнформацию(Команда)
	// Вставить содержимое обработчика.
	Обр=ПолучитьФорму("Обработка._Запуск_ХамелеонЦРПТ.Форма.Форма");
	Если Обр.Организации.Количество()=0 Тогда
		Обр.ПодключитьсяКЦРПТ(Команда,Ложь);
	КонецЕсли;
	Если Обр.Организации.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
			
	Если Элементы.Список.ТекущиеДанные<>Неопределено Тогда
	ОбщиеМетоды_НаКлиенте_ХамелеонЦРПТ.ПолучитьИнформациюПоКМ(ДеревоКМ,Элементы.Список.ТекущиеДанные.СерийныйНомер,Обр.Пользователь);
	Элементы.Страницы.ТекущаяСтраница=Элементы.ИнформацияОКМ;
	КонецЕсли;
КонецПроцедуры
